from pprint import pprint

import json

a = json.loads('''[
    {
        "姓名": "莊怡哲",
        "授課系所": "化工系",
        "職稱": "教授",
        "私心推薦": "4.0 ★",
        "學到東西": "3.0 ★",
        "口條好": "3.0 ★",
        "課業壓力": "4.0 ★",
        "給分甜度": "4.0 ★",
        "平均成績": null,
        "最高學歷": null,
        "值得一提": null,
        "綽號": null,
        "點名方式": null,
        "urschool_id": "e4f98771-e7b4-44e0-bd7b-ed2a5d1ce135"
    }
]''')
a.append(json.loads("""{
        "姓名": "莊怡哲",
        "授課系所": "化工系",
        "職稱": "教授",
        "私心推薦": "4.0 ★",
        "學到東西": "3.0 ★",
        "口條好": "3.0 ★",
        "課業壓力": "4.0 ★",
        "給分甜度": "4.0 ★",
        "平均成績": null,
        "最高學歷": null,
        "值得一提": null,
        "綽號": null,
        "點名方式": null,
        "urschool_id": "e4f98771-e7b4-44e0-bd7b-ed2a5d1ce135"
    }"""))
pprint(a)
